## Terraform Plan — staging
<details><summary>Show Plan</summary>

```
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
environments/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/testing-cloudflare-worker/testing-cloudflare-worker/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/testing-cloudflare-worker/testing-cloudflare-worker

To view this run in a browser, visit:
https://app.terraform.io/app/answer-me/answer-me-staging/runs/run-NZbHu5UUAFvDbnAh

Waiting for the plan to start...

Terraform v1.14.6
on linux_amd64
Initializing plugins and modules...
cloudflare_d1_database.this: Refreshing state... [id=0c3d6548-16a9-4da4-898b-74bd1ddf36f4]
module.worker.cloudflare_worker.this: Refreshing state... [id=1d64818569174ec49db93630848550a3]
module.worker.cloudflare_worker_version.this: Refreshing state... [id=d2358d5f-5dd7-468a-834f-46489d8146e1]
module.worker.cloudflare_workers_deployment.this: Refreshing state... [id=41d34369-5626-49ca-be47-925bb32aaaf4]
cloudflare_d1_database.this: Drift detected (update)
module.worker.cloudflare_workers_deployment.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ created_on          = "2026-02-26T15:00:46Z" -> (known after apply)
      ~ id                  = "d2358d5f-5dd7-468a-834f-46489d8146e1" -> (known after apply)
      + limits              = (known after apply)
      + main_script_base64  = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "dist/index.js" -> null
              - content_sha256 = "4ed3cce01fe198c188753a9d8f3e565eced98ec5b6424c50983330567f7faac5" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "dist/index.js"
              + content_sha256 = "879909ec6f7bf6450efafa4f79e6c3e8b9d74218a815403280117e9dfa8cd383"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 1 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 9 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      + author_email = (known after apply)
      ~ created_on   = "2026-02-26T15:00:47Z" -> (known after apply)
      ~ id           = "41d34369-5626-49ca-be47-925bb32aaaf4" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "d2358d5f-5dd7-468a-834f-46489d8146e1" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>